a = 'Топинамбур'
print(a[0])
print(a[-1])
print(a[5::])
print(a[::-1])
print(a[1::2])






#В переменную example запишите любую строку.
#Выведите на экран(в консоль) первый символ этой строки.
#Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
#Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
#Выведите на экран(в консоль) это слово наоборот.
#ыведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')


# Вывод на экран(в консоль):
# Т
# р
# амбур
# рубманипоТ
# оиабр